## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 1 to change, 10 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.celery-core-tasks-scalable-pods-high-cpu-warning[0]`     |
|        | `aws_cloudwatch_metric_alarm.celery-core-tasks-scalable-replicas-unavailable[0]`      |
|        | `aws_cloudwatch_metric_alarm.celery-core-tasks-static-pods-high-cpu-warning[0]`       |
|        | `aws_cloudwatch_metric_alarm.celery-core-tasks-static-pods-high-memory-warning[0]`    |
|        | `aws_cloudwatch_metric_alarm.celery-core-tasks-static-replicas-unavailable[0]`        |
|        | `aws_cloudwatch_metric_alarm.celery-email-send-static-replicas-unavailable[0]`        |
|        | `aws_cloudwatch_metric_alarm.celery-sms-dedicated-static-pods-high-cpu-warning[0]`    |
|        | `aws_cloudwatch_metric_alarm.celery-sms-dedicated-static-pods-high-memory-warning[0]` |
|        | `aws_cloudwatch_metric_alarm.celery-sms-dedicated-static-replicas-unavailable[0]`     |
|        | `aws_cloudwatch_metric_alarm.celery-sms-send-static-replicas-unavailable[0]`          |
| delete | `aws_cloudwatch_metric_alarm.celery-email-send-primary-replicas-unavailable[0]`       |
|        | `aws_cloudwatch_metric_alarm.celery-primary-pods-high-cpu-warning[0]`                 |
|        | `aws_cloudwatch_metric_alarm.celery-primary-pods-high-memory-warning[0]`              |
|        | `aws_cloudwatch_metric_alarm.celery-primary-replicas-unavailable[0]`                  |
|        | `aws_cloudwatch_metric_alarm.celery-scalable-pods-high-cpu-warning[0]`                |
|        | `aws_cloudwatch_metric_alarm.celery-scalable-replicas-unavailable[0]`                 |
|        | `aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning[0]`                     |
|        | `aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning[0]`                  |
|        | `aws_cloudwatch_metric_alarm.celery-sms-replicas-unavailable[0]`                      |
|        | `aws_cloudwatch_metric_alarm.celery-sms-send-primary-replicas-unavailable[0]`         |
| update | `aws_cloudwatch_dashboard.notify_system[0]`                                           |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/13639681105).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      ~ dashboard_body = (sensitive value)
        id             = "Notify-System-Overview"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.celery-core-tasks-scalable-pods-high-cpu-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-core-tasks-scalable-pods-high-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of celery-core-tasks-scalable pods >=50% during 10 minutes"
      + alarm_name                            = "celery-core-tasks-scalable-pods-high-cpu-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          + "Namespace"   = "notification-canada-ca"
          + "Service"     = "notify-celery-core-tasks-scalable"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "pod_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.celery-core-tasks-scalable-replicas-unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-core-tasks-scalable-replicas-unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Celery Core Tasks Scalable Replicas Unavailable"
      + alarm_name                            = "celery-core-tasks-scalable-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"

      + metric_query {
          + id          = "m1"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "deployment"  = "notify-celery-core-tasks-scalable"
                  + "namespace"   = "notification-canada-ca"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.celery-core-tasks-static-pods-high-cpu-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-core-tasks-static-pods-high-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of celery-core-tasks-static pods >=50% during 10 minutes"
      + alarm_name                            = "celery-core-tasks-static-pods-high-cpu-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          + "Namespace"   = "notification-canada-ca"
          + "Service"     = "notify-celery-core-tasks-static"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "pod_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.celery-core-tasks-static-pods-high-memory-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-core-tasks-static-pods-high-memory-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average memory of celery-core-tasks-static pods >=50% during 10 minutes"
      + alarm_name                            = "celery-core-tasks-static-pods-high-memory-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          + "Namespace"   = "notification-canada-ca"
          + "Service"     = "notify-celery-core-tasks-static"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "pod_memory_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.celery-core-tasks-static-replicas-unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-core-tasks-static-replicas-unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Celery Core Tasks Static Replicas Unavailable"
      + alarm_name                            = "celery-core-tasks-static-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"

      + metric_query {
          + id          = "m1"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "deployment"  = "notify-celery-core-tasks-static"
                  + "namespace"   = "notification-canada-ca"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.celery-email-send-primary-replicas-unavailable[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.celery-email-send-primary-replicas-unavailable is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "celery-email-send-primary-replicas-unavailable" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "Celery Email Send Primary Replicas Unavailable" -> null
      - alarm_name                            = "celery-email-send-primary-replicas-unavailable" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:celery-email-send-primary-replicas-unavailable" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "celery-email-send-primary-replicas-unavailable" -> null
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "breaching" -> null
        # (7 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  - "deployment"  = "notify-celery-email-send-primary"
                  - "namespace"   = "notification-canada-ca"
                } -> null
              - metric_name = "kube_deployment_status_replicas_unavailable" -> null
              - namespace   = "ContainerInsights/Prometheus" -> null
              - period      = 300 -> null
              - stat        = "Minimum" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.celery-email-send-static-replicas-unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-email-send-static-replicas-unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Celery Email Send Static Replicas Unavailable"
      + alarm_name                            = "celery-email-send-static-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"

      + metric_query {
          + id          = "m1"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "deployment"  = "notify-celery-email-send-static"
                  + "namespace"   = "notification-canada-ca"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.celery-primary-pods-high-cpu-warning[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.celery-primary-pods-high-cpu-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "celery-primary-pods-high-cpu-warning" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "Average CPU of Primary Celery pods >=50% during 10 minutes" -> null
      - alarm_name                            = "celery-primary-pods-high-cpu-warning" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:celery-primary-pods-high-cpu-warning" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          - "Namespace"   = "notification-canada-ca"
          - "Service"     = "notify-celery-primary"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "celery-primary-pods-high-cpu-warning" -> null
      - insufficient_data_actions             = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - metric_name                           = "pod_cpu_utilization" -> null
      - namespace                             = "ContainerInsights" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 50 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.celery-primary-pods-high-memory-warning[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.celery-primary-pods-high-memory-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "celery-primary-pods-high-memory-warning" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "Average memory of Primary Celery pods >=50% during 10 minutes" -> null
      - alarm_name                            = "celery-primary-pods-high-memory-warning" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:celery-primary-pods-high-memory-warning" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          - "Namespace"   = "notification-canada-ca"
          - "Service"     = "notify-celery-primary"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "celery-primary-pods-high-memory-warning" -> null
      - insufficient_data_actions             = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - metric_name                           = "pod_memory_utilization" -> null
      - namespace                             = "ContainerInsights" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 50 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.celery-primary-replicas-unavailable[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.celery-primary-replicas-unavailable is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "celery-primary-replicas-unavailable" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "Celery Primary Replicas Unavailable" -> null
      - alarm_name                            = "celery-primary-replicas-unavailable" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:celery-primary-replicas-unavailable" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "celery-primary-replicas-unavailable" -> null
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "breaching" -> null
        # (7 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  - "deployment"  = "notify-celery-primary"
                  - "namespace"   = "notification-canada-ca"
                } -> null
              - metric_name = "kube_deployment_status_replicas_unavailable" -> null
              - namespace   = "ContainerInsights/Prometheus" -> null
              - period      = 300 -> null
              - stat        = "Minimum" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.celery-scalable-pods-high-cpu-warning[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.celery-scalable-pods-high-cpu-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "celery-scalable-pods-high-cpu-warning" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "Average CPU of Scalable Celery pods >=50% during 10 minutes" -> null
      - alarm_name                            = "celery-scalable-pods-high-cpu-warning" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:celery-scalable-pods-high-cpu-warning" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          - "Namespace"   = "notification-canada-ca"
          - "Service"     = "notify-celery-scalable"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "celery-scalable-pods-high-cpu-warning" -> null
      - insufficient_data_actions             = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - metric_name                           = "pod_cpu_utilization" -> null
      - namespace                             = "ContainerInsights" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 50 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.celery-scalable-replicas-unavailable[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.celery-scalable-replicas-unavailable is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "celery-scalable-replicas-unavailable" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "Celery Scalable Replicas Unavailable" -> null
      - alarm_name                            = "celery-scalable-replicas-unavailable" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:celery-scalable-replicas-unavailable" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 3 -> null
      - id                                    = "celery-scalable-replicas-unavailable" -> null
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "breaching" -> null
        # (7 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  - "deployment"  = "notify-celery-scalable"
                  - "namespace"   = "notification-canada-ca"
                } -> null
              - metric_name = "kube_deployment_status_replicas_unavailable" -> null
              - namespace   = "ContainerInsights/Prometheus" -> null
              - period      = 300 -> null
              - stat        = "Minimum" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.celery-sms-dedicated-static-pods-high-cpu-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-sms-dedicated-static-pods-high-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of celery-sms-dedicated-static pods >=50% during 10 minutes"
      + alarm_name                            = "celery-sms-dedicated-static-pods-high-cpu-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          + "Namespace"   = "notification-canada-ca"
          + "Service"     = "notify-celery-sms-dedicated-static"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "pod_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.celery-sms-dedicated-static-pods-high-memory-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-sms-dedicated-static-pods-high-memory-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average memory of celery-sms-dedicated-static >=50% during 10 minutes"
      + alarm_name                            = "celery-sms-dedicated-static-pods-high-memory-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
          + "Namespace"   = "notification-canada-ca"
          + "Service"     = "notify-celery-sms-dedicated-static"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "pod_memory_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.celery-sms-dedicated-static-replicas-unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-sms-dedicated-static-replicas-unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Celery SMS Dedicated Static Replicas Unavailable"
      + alarm_name                            = "celery-sms-dedicated-static-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"

      + metric_query {
          + id          = "m1"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "deployment"  = "notify-celery-sms-dedicated-static"
                  + "namespace"   = "notification-canada-ca"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Average"
             ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
